# -*- coding: utf-8 -*- 

# выполни строчка за строчкой

# 1. Правильно ли введены переменные?:

a = 5
a1b2_ = 1234
y = "6"
A = 1
Bc = 3
aBc = 'abc'
1name = 'Abba'
>a1b2_ = 50
a_b = 2
a+b = 3
'a' = 7
c = '8'
myName = 5
___c = 4
0q = 35
ф = 3
myName == myname
.q = 88
Bc = y
myname = 2
"это" = "восьми"

# 2. Что команда print выдаст на экране?

# Будет 4 шага: подготовка, вопрос, ответ, проверка

print(a) # подготовка
print(myName)

res = (a == myName)

# ваш ответ

print(res) # проверка

# 3. Что команда print выдаст на экране?

print(Bc) # подготовка
# ваш ответ
print(Bc == '8') # проверка

# 4. Что команда print выдаст на экране?

print(c) # подготовка
# ваш ответ
print(c == '8') # проверка

# 5. Что команда print выдаст на экране?

print(a_b) # подготовка
# ответ
print(myname == a_b) # проверка

# 6. Что команда print выдаст на экране?

print(1/3) # подготовка
# ответ
print(1/3 != 0.333)

# 7. Что команда print выдаст на экране?

print(___c)
print(__c)
print(c)

# 8. Что команда print выдаст на экране?

print(ф)
print(фф)
print(ф + ф)

# 9. Что команда print выдаст на экране?

print(myname)
print(myName) # подготовка

print(myName + myname)
